In [66]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [67]:
df=pd.read_csv('jeopardy.csv')
print(df.shape)
print(df.size)
df.head()

(216930, 7)
1518510

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

###### 1.Checking for null values and correcting it

In [68]:
df.isnull().sum().sum()

2

In [69]:
#So total 2 null, let's see where 
df.isnull().sum()

Show Number    0
 Air Date      0
 Round         0
 Category      0
 Value         0
 Question      0
 Answer        2
dtype: int64

In [70]:
# Since it's text based, therefore just dropping the rows with Answer nan
df=df.dropna()

In [71]:
df.isnull().sum()
print(df.shape) # should be two rows less

(216928, 7)

In [72]:
df.columns=['Show Number', 'Air Date', 'Round', 'Category', 'Value',
       'Question', 'Answer']   # Renaming the columns

##### 2.Every rows for which the , 'Question' column has "King" or "England" in it

In [79]:
new_df=df[df.Question.apply(lambda x: 'king' in x or 'England' in x or 'King' in x)].reset_index()
print(new_df.shape)
new_df.head()

(8373, 8)

,index,Show Number,Air Date,Round,Category,Value,Question,Answer
0,34,4680,2004-12-31,Double Jeopardy!,"""X""s & ""O""s",400.0,Around 100 A.D. Tacitus wrote a book on how th...,oratory
1,40,4680,2004-12-31,Double Jeopardy!,DR. SEUSS AT THE MULTIPLEX,1200.0,"<a href=""http://www.j-archive.com/media/2004-1...",Yertle
2,50,4680,2004-12-31,Double Jeopardy!,DR. SEUSS AT THE MULTIPLEX,2000.0,"<a href=""http://www.j-archive.com/media/2004-1...",Bartholomew Cubbins
3,56,5957,2010-07-06,Jeopardy!,"GEOGRAPHY ""E""",200.0,It's the largest kingdom in the United Kingdom,England
4,72,5957,2010-07-06,Jeopardy!,LET'S BOUNCE,600.0,"In this kid's game, you bounce a small rubber ...",jacks

##### 3. Converting the 'Value' column to String

In [76]:
df['Value']=df['Value'].replace('None','$200')
(df['Value']=='None').sum()

0

##### Playing with the Value column

In [78]:
#Converting 'Value' to 'float' from 'object' type
def clean_it(x):
    #if(x=='None'):
        #return ('200')
    #else:
    if(isinstance(x,str)):
        return (x.replace('$','').replace(',',''))
    return x

df['Value']=df['Value'].apply(clean_it).astype('float')
df.tail()

,Show Number,Air Date,Round,Category,Value,Question,Answer
216925,4999,2006-05-11,Double Jeopardy!,RIDDLE ME THIS,2000.0,This Puccini opera turns on the solution to 3 ...,Turandot
216926,4999,2006-05-11,Double Jeopardy!,"""T"" BIRDS",2000.0,In North America this term is properly applied...,a titmouse
216927,4999,2006-05-11,Double Jeopardy!,AUTHORS IN THEIR YOUTH,2000.0,"In Penny Lane, where this ""Hellraiser"" grew up...",Clive Barker
216928,4999,2006-05-11,Double Jeopardy!,QUOTATIONS,2000.0,"From Ft. Sill, Okla. he made the plea, Arizona...",Geronimo
216929,4999,2006-05-11,Final Jeopardy!,HISTORIC NAMES,200.0,A silent movie title includes the last name of...,Grigori Alexandrovich Potemkin

##### 4. Dealing with 'Air Date'

In [87]:
df['Air Date']=pd.to_datetime(df['Air Date'])
df['year']=df['Air Date'].dt.year
df['day_name']=df['Air Date'].dt.weekday_name
df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer,year,day_name
0,4680,2004-12-31,Jeopardy!,HISTORY,200.0,"For the last 8 years of his life, Galileo was ...",Copernicus,2004,Friday
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,200.0,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe,2004,Friday
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,200.0,The city of Yuma in this state has a record av...,Arizona,2004,Friday
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,200.0,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's,2004,Friday
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,200.0,"Signer of the Dec. of Indep., framer of the Co...",John Adams,2004,Friday